<?php

return [
    'settings' => [
        'title' => 'تحسين سرعة الصفحة',
        'description' => 'تقليل حجم ملف HTML، تضمين CSS، إزالة التعليقات...',
        'enable' => 'تمكين تحسين سرعة الصفحة؟',
    ],
    'collapse_white_space' => 'طي المسافات البيضاء',
    'collapse_white_space_description' => 'يقلل هذا المرشح من البايتات المرسلة في ملف HTML عن طريق إزالة المسافات البيضاء غير الضرورية.',
    'elide_attributes' => 'إزالة السمات',
    'elide_attributes_description' => 'يقلل هذا المرشح من حجم ملفات HTML المنقولة عن طريق إزالة السمات من العلامات عندما يكون القيمة المحددة تساوي القيمة الافتراضية لتلك السمة. يمكن أن يوفر هذا عددًا معقولًا من البايتات، وقد يجعل المستند أكثر ضغطًا عن طريق توحيد العلامات المتأثرة.',
    'inline_css' => 'تضمين CSS',
    'inline_css_description' => 'يحول هذا المرشح الخاصية "style" المضمنة في العلامات إلى فئات من خلال نقل CSS إلى الرأس.',
    'insert_dns_prefetch' => 'إدراج DNS prefetch',
    'insert_dns_prefetch_description' => 'يقوم هذا المرشح بحقن علامات في HEAD لتمكين المتصفح من القيام بـ DNS prefetching.',
    'remove_comments' => 'إزالة التعليقات',
    'remove_comments_description' => 'يقوم هذا المرشح بالتخلص من التعليقات في ملفات HTML و JS و CSS. يقلل هذا المرشح من حجم ملفات HTML المنقولة عن طريق إزالة التعليقات. وتعتمد فعالية هذا المرشح على محتوى ملف HTML، حيث يمكن أن يقلل بشكل كبير من عدد البايتات المنقولة عبر الشبكة.',
    'remove_quotes' => 'إزالة علامات الاقتباس',
    'remove_quotes_description' => 'يقوم هذا المرشح بالتخلص من علامات الاقتباس الزائدة من سمات HTML. على الرغم من أنها مطلوبة حسب المواصفات المختلفة لـ HTML، يسمح المتصفحون بحذفها عندما تتكون قيمة سمة من مجموعة معينة من الأحرف (الأبجدية وبعض أحرف الترقيم).',
    'defer_javascript' => 'تأجيل الجافا سكريبت',
    'defer_javascript_description' => 'يؤجل تنفيذ الجافا سكريبت في HTML. إذا كان هناك حاجة لإلغاء التأجيل في بعض النصوص، يمكن استخدام data-pagespeed-no-defer كسمة script لإلغاء التأجيل.',
];
