<?php

return [
    'login' => [
        'username' => 'البريد الإلكتروني/اسم المستخدم',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'title' => 'تسجيل الدخول',
        'remember' => 'تذكرني؟',
        'login' => 'تسجيل الدخول',
        'placeholder' => [
            'username' => 'الرجاء إدخال اسم المستخدم',
            'email' => 'الرجاء إدخال البريد الإلكتروني',
        ],
        'success' => 'تم تسجيل الدخول بنجاح!',
        'fail' => 'اسم المستخدم أو كلمة المرور غير صحيحة.',
        'not_active' => 'لم يتم تنشيط حسابك بعد!',
        'banned' => 'تم حظر هذا الحساب.',
        'logout_success' => 'تم تسجيل الخروج بنجاح!',
        'dont_have_account' => 'ليس لديك حساب في هذا النظام، يرجى الاتصال بالمسؤول للحصول على مزيد من المعلومات!',
    ],
    'forgot_password' => [
        'title' => 'نسيت كلمة المرور',
        'message' => '<p>هل نسيت كلمة المرور؟</p><p>الرجاء إدخال بريدك الإلكتروني. سيقوم النظام بإرسال بريد إلكتروني يحتوي على رابط نشط لإعادة تعيين كلمة المرور الخاصة بك.</p>',
        'submit' => 'إرسال',
    ],
    'reset' => [
        'new_password' => 'كلمة المرور الجديدة',
        'password_confirmation' => 'تأكيد كلمة المرور الجديدة',
        'email' => 'البريد الإلكتروني',
        'title' => 'إعادة تعيين كلمة المرور الخاصة بك',
        'update' => 'تحديث',
        'wrong_token' => 'هذا الرابط غير صالح أو انتهت صلاحيته. يرجى المحاولة باستخدام نموذج إعادة التعيين مرة أخرى.',
        'user_not_found' => 'هذا الاسم غير موجود.',
        'success' => 'تم إعادة تعيين كلمة المرور بنجاح!',
        'fail' => 'الرمز غير صالح، انتهت صلاحية رابط إعادة تعيين كلمة المرور!',
        'reset' => [
            'title' => 'إعادة تعيين كلمة المرور عبر البريد الإلكتروني',
        ],
        'send' => [
            'success' => 'تم إرسال بريد إلكتروني إلى حساب البريد الإلكتروني الخاص بك. يرجى التحقق واستكمال هذا الإجراء.',
            'fail' => 'لا يمكن إرسال البريد الإلكتروني في هذا الوقت. يرجى المحاولة مرة أخرى لاحقًا.',
        ],
        'new-password' => 'كلمة المرور الجديدة',
    ],
    'email' => [
        'reminder' => [
            'title' => 'إعادة تعيين كلمة المرور عبر البريد الإلكتروني',
        ],
    ],
    'password_confirmation' => 'تأكيد كلمة المرور',
    'failed' => 'فشل',
    'throttle' => 'التباطؤ',
    'not_member' => 'ليس عضوا بعد؟',
    'register_now' => 'سجل الآن',
    'lost_your_password' => 'هل نسيت كلمة المرور؟',
    'login_title' => 'المشرف',
    'login_via_social' => 'تسجيل الدخول باستخدام الشبكات الاجتماعية',
    'back_to_login' => 'العودة إلى صفحة تسجيل الدخول',
    'sign_in_below' => 'قم بتسجيل الدخول أدناه',
    'languages' => 'اللغات',
    'reset_password' => 'إعادة تعيين كلمة المرور',
    'settings' => [
        'email' => [
            'title' => 'ACL',
            'description' => 'تكوين البريد الإلكتروني لنظام التحكم في الوصول',
        ],
    ],
];
