<?php

return [
    'cache_management' => 'إدارة الذاكرة المؤقتة (Cache)',
    'cache_commands' => 'مسح أوامر الذاكرة المؤقتة (Cache)',
    'commands' => [
        'clear_cms_cache' => [
            'title' => 'مسح جميع ذاكرة التخزين المؤقتة للنظام (CMS)',
            'description' => 'مسح ذاكرة التخزين المؤقتة للنظام (CMS): تخزين قاعدة البيانات، الكتل الثابتة... قم بتشغيل هذا الأمر عندما لا ترى التغييرات بعد تحديث البيانات.',
            'success_msg' => 'تم مسح الذاكرة بنجاح',
        ],
        'refresh_compiled_views' => [
            'title' => 'تحديث العروض الملهمة',
            'description' => 'مسح العروض الملهمة لجعلها حديثة.',
            'success_msg' => 'تم تحديث عروض الذاكرة المؤقتة بنجاح',
        ],
        'clear_config_cache' => [
            'title' => 'مسح ذاكرة تخزين التكوين',
            'description' => 'قد تحتاج إلى تحديث ذاكرة التخزين المؤقتة للتكوين عند تغيير شيء على بيئة الإنتاج.',
            'success_msg' => 'تم مسح ذاكرة تخزين التكوين بنجاح',
        ],
        'clear_route_cache' => [
            'title' => 'مسح ذاكرة تخزين مسار النظام',
            'description' => 'مسح ذاكرة تخزين مسار النظام.',
            'success_msg' => 'تم مسح ذاكرة تخزين مسار النظام بنجاح',
        ],
        'clear_log' => [
            'title' => 'مسح السجل',
            'description' => 'مسح ملفات سجل النظام',
            'success_msg' => 'تم مسح سجل النظام بنجاح',
        ],
    ],
];
