<?php

return [
    '401_title' => 'تم رفض الإذن',
    '401_msg' => '<li>لم يتم منحك الوصول إلى القسم من قبل المسؤول.</li>
                    <li>قد تكون لديك نوع حساب غير صحيح.</li>
                    <li>ليس لديك الإذن لعرض المورد المطلوب.</li>
                    <li>قد تكون اشتراكك قد انتهى.</li>',
    '404_title' => 'لا يمكن العثور على الصفحة',
    '404_msg' => '<li>الصفحة التي طلبتها غير موجودة.</li>
                    <li>الرابط الذي قمت بالنقر عليه لم يعد موجودًا.</li>
                    <li>قد تكون الصفحة قد انتقلت إلى موقع جديد.</li>
                    <li>قد يكون قد حدث خطأ.</li>
                    <li>ليس لديك الإذن لعرض المورد المطلوب.</li>',
    '500_title' => 'لا يمكن تحميل الصفحة',
    '500_msg' => '<li>الصفحة التي طلبتها غير موجودة.</li>
                    <li>الرابط الذي قمت بالنقر عليه لم يعد موجودًا.</li>
                    <li>قد تكون الصفحة قد انتقلت إلى موقع جديد.</li>
                    <li>قد يكون قد حدث خطأ.</li>
                    <li>ليس لديك الإذن لعرض المورد المطلوب.</li>',
    'reasons' => 'يمكن أن يكون هذا بسبب عدة أسباب',
    'try_again' => 'يرجى المحاولة مرة أخرى خلال بضع دقائق، أو العودة إلى الصفحة الرئيسية عن طريق <a href=":link">النقر هنا</a>.',
    'not_found' => 'غير موجود',
    'results_not_found' => 'لم يتم العثور على نتائج!',
    'error_when_sending_email' => 'خطأ أثناء إرسال البريد الإلكتروني. هناك خطأ في إعدادات البريد الإلكتروني في الإدارة → الإعدادات → البريد الإلكتروني، يرجى التحقق من إعداداتك مرة أخرى.',
];
