<?php

return [
    'settings' => [
        'title' => 'كلمة التحقق (كابتشا)',
        'description' => 'إعدادات كلمة التحقق من Google',
        'captcha_site_key' => 'مفتاح موقع كلمة التحقق',
        'captcha_secret' => 'سر كلمة التحقق',
        'enable_captcha' => 'تمكين كلمة التحقق؟',
        'helper' => 'انتقل هنا للحصول على بيانات الاعتماد https://www.google.com/recaptcha/admin#list.',
        'hide_badge' => 'إخفاء شارة كلمة التحقق (للإصدار 3)',
        'type' => 'النوع',
        'v2_description' => 'V2 (التحقق من الطلبات بتحدي)',
        'v3_description' => 'V3 (التحقق من الطلبات بتصنيف)',
    ],
    'numbers' => [
        '0' => 'صفر',
        '1' => 'واحد',
        '2' => 'اثنان',
        '3' => 'ثلاثة',
        '4' => 'أربعة',
        '5' => 'خمسة',
        '6' => 'ستة',
        '7' => 'سبعة',
        '8' => 'ثمانية',
        '9' => 'تسعة',
        '10' => 'عشرة',
        '11' => 'إحدى عشرة',
        '12' => 'اثنتا عشرة',
    ],
    'operands' => [
        '+' => 'بالإضافة إلى',
        '-' => 'ناقص',
        '*' => 'ضرب في',
        '/' => 'مقسوم على',
    ],
];
