<?php

return [
    'settings' => [
        'title' => 'إعدادات تسجيل الدخول الاجتماعي',
        'description' => 'تكوين خيارات تسجيل الدخول الاجتماعي',
        'facebook' => [
            'title' => 'إعدادات تسجيل الدخول باستخدام فيسبوك',
            'description' => 'تمكين/تعطيل وتكوين بيانات التطبيق لتسجيل الدخول باستخدام فيسبوك',
            'app_id' => 'معرف التطبيق',
            'app_secret' => 'سر التطبيق',
            'helper' => 'يرجى الانتقال إلى https://developers.facebook.com لإنشاء تطبيق جديد وتحديث معرف التطبيق وسر التطبيق. عنوان URL للرد هو :callback',
        ],
        'google' => [
            'title' => 'إعدادات تسجيل الدخول باستخدام جوجل',
            'description' => 'تمكين/تعطيل وتكوين بيانات التطبيق لتسجيل الدخول باستخدام جوجل',
            'app_id' => 'معرف التطبيق',
            'app_secret' => 'سر التطبيق',
            'helper' => 'يرجى الانتقال إلى https://console.developers.google.com/apis/dashboard لإنشاء تطبيق جديد وتحديث معرف التطبيق وسر التطبيق. عنوان URL للرد هو :callback',
        ],
        'github' => [
            'title' => 'إعدادات تسجيل الدخول باستخدام جيت هاب',
            'description' => 'تمكين/تعطيل وتكوين بيانات التطبيق لتسجيل الدخول باستخدام جيت هاب',
            'app_id' => 'معرف التطبيق',
            'app_secret' => 'سر التطبيق',
            'helper' => 'يرجى الانتقال إلى https://github.com/settings/developers لإنشاء تطبيق جديد وتحديث معرف التطبيق وسر التطبيق. عنوان URL للرد هو :callback',
        ],
        'linkedin' => [
            'title' => 'إعدادات تسجيل الدخول باستخدام لينكدين',
            'description' => 'تمكين/تعطيل وتكوين بيانات التطبيق لتسجيل الدخول باستخدام لينكدين',
            'app_id' => 'معرف التطبيق',
            'app_secret' => 'سر التطبيق',
            'helper' => 'يرجى الانتقال إلى https://www.linkedin.com/developers/apps/new لإنشاء تطبيق جديد وتحديث معرف التطبيق وسر التطبيق. عنوان URL للرد هو :callback',
        ],
        'enable' => 'تمكين؟',
    ],
    'menu' => 'تسجيل الدخول الاجتماعي',
];
